import react from 'react';
import {View,Text,StyleSheet, ScrollView} from "react-native";
//import globalStyles from "./global-styles";

export default function TabAbout({navigation}) {
    
  return (
    //<View style={globalStyles.container}>
    <View style={styles.container}>
      <Text style={{fontSize:18}}>ปรางวิว อยุธยา</Text>
      <ScrollView contentContainerStyle={styles.scrollViewContent} 
      style={{alignItems: 'center'}} horizontal={false}>
        <Text style={styles.text}>
      ปรางวิว อยุธยา คาเฟ่อยุธยา สุดโมเดิร์นในโทนสีขาวสุดคลาสสิค แห่งเมืองอโยธยา ตัวร้านเป็นมีหน้าต่างแบบกระจก มองไปนอกร้านมองเห็นวิวของมองไปนอกร้านจะเห็นวิวของวัดราชบูรณะ มองเห็นยอดพระปรางค์อันโดดเด่น เป็นที่มาของชื่อร้าน ภายในตกแต่งสวยโปร่งสบายตา แสงนวลอบอุ่น  อาหารเครื่องดื่มมีทั้งคาวหวานแนวฟิวชั่น ผสมผสานความโบราณกับความสมัยใหม่
      สำหรับการมาที่ร้านด้วยรถส่วนตัว ด้วยโลเคชั่นร้านติดถนนใหญ่จึงไม่มีที่จอดรถ หน้าร้านจอดรถได้ประมาณ 2 คัน สามารถนำรถไปจอดได้ที่ลานจอดรถของวัดราชบูรณะแล้วเดินข้ามฝั่งมา หรือหาที่จอดรถในโซนนั้นซึ่งส่วนใหญ่จะยาก เพราะมีแต่ร้านค้า ร้านกาแฟ ซึ่งกันพื้นที่จอดไว้ให้ลูกค้าของตน ตัวร้านเป็นทรงสี่เหลี่ยมสีขาวมองจากข้างนอก เหมือนไม่ใหญ่มาก แต่ภายในร้านกว้างขวางมีโซนที่นั่งหลายมุม
      มุมต่างๆ ภายในร้านตกแต่งเรียบง่าย ในสไตล์โมเดิร์นผสมกลิ่นอายความเป็นไทย มีความโปร่งโล่งเหมือนสตูดิโอแสงธรรมชาติ เป็นร้านที่แสงสวยมากเหมาะกับการถ่ายรูป  ด้วยการใช้โทนสีขาว เฟอร์นิเจอร์แบบคลาสสิคเรียบเก๋ที่ใช้ทำจากไม้
      ส่วนเมนู มีให้เลือกทั้งเครื่องดื่ม ของหวาน ของคาว แบบแนวฟิวชั่น ผสมผสานความโบราณกับความสมัยใหม่ เครื่องดื่มเราสั่ง ชาไทยท๊อปปิ้งด้วยขนมฝอยทอง และปรางค์วิวอโรเมติก เป็นเลมอนโซดาและไซรับกลิ่นกุหลาบ ตกแต่งด้วยกลีบกุหลาบ และทับทิม ดื่มแล้วให้ความรู้สึกสดชื่น เมนูยังแฝงไปด้วยกิมมิคเป็นน้ำไซรับกลิ่นกุหลายให้หยดลงไปตามความชอบ




        </Text>
      </ScrollView>
    </View>
  
      
  );
}
const styles = StyleSheet.create({
  container:{
    flex: 1,
    marginTop: 50,
  },
  scrollViewContent:{
    margin: 5,
    padding:20,
    backgroundColor:'#2F4F4F'
},
  text:{
    fontSize: 16,
    color: '#E6E6FA'
}

})